#include <iostream>
using namespace std;

int main()
{

}

/*
 
//1. 입력 받은 수가, 19보다 크거나 같으면 "1", 아니면 "0"을 출력 하세요. (if else 사용)

//2. 입력 받은 수가, 90이상이면 "A", 80이상이면 "B", 70이상이면 "C", 아니면 "F"를 출력하세요. (else if 문)

//3. 입력 받은 수가, 1, 이면 "Excellent", 2혹은 3이면 "Great", 아니면 "Good"을 출력하세요. (switch case문)

//4. 입력 받은 수가 0보다 작으면 종료하고, 아니면 계속 입력받아 출력하는 코드를 작성하세요 (while 문 사용)

//5. 1부터 10 출력하기, 10부터 1 출력하기 (for 문 사용)

//6. 1부터 100까지 모두 더하기 (for 문 사용)

//7. 구구단 3단 출력하기 (while 문 사용)

//8. 구구단 2단부터 9단 출력하기 (이중 for 문 사용)

//9. 1부터 10까지 수에서, 5이하만 출력하기 (break)

//10. 1부터 10까지 수에서 짝수 출력하기 (continue 사용)


//11. 1부터 10까지 수에서 짝수 출력하기 (if나 continue 쓰지 않고 작성)      //

//12. 교환 – 두개의 변수를 선언하고 두 변수의 값을 서로 바꾸어 출력해보세요.

//13. 비교 – 두 수를 입력 받아, 큰 수를 출력하세요.

//14. 배수 - 1~100 사이 수중에서, 13의 배수는 몇개인지 출력하세요.

//15. 절대값 – 정수를 입력 받아, 절대값을 출력하세요.

//16. 1보다 큰 수를 입력 받아, 1부터 그 수까지의 곱을 구하세요.  ( 3 --> 6 )
    
//17. 총합, 평균 – 입력 받은 수들의 총합과 평균을 구해서 출력하세요. (while, 0 입력하면 종료)
    
//18. 최대, 최소 - 입력 받은 수들 중에서, 가장 큰 수 출력하기. (while, 0 입력하면 종료)
        
//19. 문자 - 입력 받은 문자가, 대문자 A ~ Z 중에 하나면 "대문자" 라고 출력하세요.

//20. 입력 받은 문자가, 대문자이면 소문자로, 소문자이면 대문자로 변경해서 출력하세요. ( A -> a, z -> Z )


//21. 정수를 입력하면, 각 자릿수의 숫자를 문자로 바꾸어 출력하세요. (123 -> 1, 2, 3)

//22. 정수 N 을 입력하면, 약수 구하기. 

//23. 정수 N 을 입력하면, 1 ~ N 사이의 소수 구하기.

//24. for문 이용하여 N 라인의 별 출력하기 (감소, 역순)

****
 ***
  **
   *
    
//25. for문 이용하여 N 라인의 별 출력하기 (피라미드)

   *
  ***
 *****
*******

*/